Repository: MaiKuraki/peek
Catalog: po/*.po
Languages: ta

source: Show the version of the program and exit
ta: நிரலின் பதிப்பைக் காட்டி வெளியேறவும்

source: Select the recording backend (gnome-shell, ffmpeg)
ta: ரெக்கார்டிங் பின்தளத்தில் தேர்ந்தெடுக்கவும் (க்னோம்-செல், ffmpeg)

source: BACKEND
ta: பின்தளத்தில்

source: Start recording in all running Peek instances
ta: இயங்கும் அனைத்து பார்வை நிகழ்வுகளிலும் பதிவு செய்யத் தொடங்குங்கள்

source: Stop recording in all running Peek instances
ta: இயங்கும் அனைத்து பார்வை நிகழ்வுகளிலும் பதிவு செய்வதை நிறுத்துங்கள்

source: Toggle recording in all running Peek instances
ta: இயங்கும் அனைத்து பார்வை நிகழ்வுகளிலும் பதிவை மாற்றவும்

source: Start Peek without the header bar
ta: தலைப்பு பட்டி இல்லாமல் கண்ணோட்டத்தைத் தொடங்குங்கள்

source: Peek
ta: பீக்

source: Unable to initialize default recording backend: %s
ta: இயல்புநிலை பதிவு பின்தளத்தில் தொடங்க முடியவில்லை: %s

source: Unable to initialize recording backend %s: %s
ta: பின்தளத்தில் பதிவு செய்வதைத் தொடங்க முடியவில்லை %s: %s

source: Recording backend unavailable
ta: பின்தளத்தில் பதிவு செய்யப்படவில்லை

source: Native Wayland backend is unsupported
ta: சொந்த வேலண்ட் பின்தளத்தில் ஆதரிக்கப்படவில்லை

source: You are running Peek natively on Wayland, this is currently unsupported. Please start Peek using XWayland by setting <tt>GDK_BACKEND=x11</tt>. For Details see the Peek <a href='https://github.com/phw/peek#why-no-native-wayland-support'>FAQ about Wayland support</a>.
ta: நீங்கள் வேலண்டில் சொந்தமாக இயங்குகிறீர்கள், இது தற்போது ஆதரிக்கப்படவில்லை. <tt> gdk_backend = x11 </tt> ஐ அமைப்பதன் மூலம் Xwayland ஐப் பயன்படுத்தி பார்க்கத் தொடங்கவும். விவரங்களுக்கு beek <a href = 'https: //github.com/phw/peek#why-no-ateative-bayland-support'> வேலேண்ட் உதவி பற்றிய கேள்விகள் </a>.

source: Peek requires FFmpeg or running GNOME Shell session.
ta: PEEK க்கு FFMPEG அல்லது இயங்கும் சினோம் செல் அமர்வு தேவை.

source: FFmpeg executable not found.
ta: Ffmpeg இயங்கக்கூடியது காணப்படவில்லை.

source: An unexpected error occurred during recording. Recording was aborted.
ta: பதிவு செய்யும் போது எதிர்பாராத பிழை ஏற்பட்டது. பதிவு கைவிடப்பட்டது.

source: Rendering animation…
ta: அனிமேசன் ரெண்டரிங்…

source: Peek will close when rendering is finished.
ta: வழங்குதல் முடிந்ததும் பீக் மூடப்படும்.

source: APNG
ta: மேலோடை

source: WebM
ta: வெப்எம்

source: Record as %s
ta: %s என பதிவு

source: Start / Stop: %s
ta: தொடக்க/நிறுத்து: %s

source: Rendering…
ta: ரெண்டரிங்…

source: Recording could not be started due to an unexpected error.
ta: எதிர்பாராத பிழை காரணமாக பதிவைத் தொடங்க முடியவில்லை.

source: Save animation
ta: அனிமேசனை சேமிக்கவும்

source: _Save
ta: _சேவ்

source: The file could not be saved to the selected location.
ta: கோப்பை தேர்ந்தெடுக்கப்பட்ட இடத்திற்கு சேமிக்க முடியவில்லை.

source: Animation saved as “%s”
ta: அனிமேசன் “%s” என சேமிக்கப்பட்டது

source: Click here to show the saved file in your file manager.
ta: சேமித்த கோப்பை உங்கள் கோப்பு மேலாளரில் காட்ட இங்கே சொடுக்கு செய்க.

source: Show in file manager
ta: கோப்பு மேலாளரில் காட்டு

source: deactivated
ta: செயலிழக்கச் செய்தது

source: Change
ta: மாற்றம்

source: Press keys…
ta: விசைகளை அழுத்தவும்…

source: Animated GIF recorder
ta: அனிமேசன் செய்யப்பட்ட GIF ரெக்கார்டர்

# Translator credits in about dialog
source: translator-credits
ta: மொழிபெயர்ப்பாளர்-வரவு

source: Start recording
ta: பதிவு செய்யத் தொடங்குங்கள்

source: New window
ta: புதிய சாளரம்

source: Set window size
ta: சாளர அளவை அமைக்கவும்

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: About Peek
ta: பீக் பற்றி

source: _Stop
ta: _ச்டாப்

source: Stop recording
ta: பதிவு செய்வதை நிறுத்துங்கள்

source: _Record
ta: _ ரெக்கார்ட்

source: Recording error
ta: பதிவு செய்யும் பிழை

source: Close
ta: மூடு

source: Please read the <a href="https://github.com/phw/peek#frequently-asked-questions">FAQs</a> before reporting this issue. If the FAQs do not answer your issue please report it and provide as much details as possible on what you were doing when the issue occurred.
ta: இந்த சிக்கலைப் புகாரளிப்பதற்கு முன் <a href = "https://github.com/phw/peek#frequenty-asked- கேள்விகள்"> கேள்விகள் </a> ஐப் படிக்கவும். கேள்விகள் உங்கள் பிரச்சினைக்கு பதிலளிக்கவில்லை என்றால், தயவுசெய்து அதைப் புகாரளித்து, சிக்கல் ஏற்பட்டபோது நீங்கள் என்ன செய்கிறீர்கள் என்பது குறித்த முடிந்தவரை விவரங்களை வழங்கவும்.

source: Show details
ta: விவரங்களைக் காட்டு

source: User interface
ta: பயனர் இடைமுகம்

source: Open file manager after saving
ta: சேமித்த பிறகு கோப்பு மேலாளரைத் திறக்கவும்

source: Show desktop notification after saving
ta: சேமித்த பிறகு டெச்க்டாப் அறிவிப்பைக் காட்டு

source: Start / stop recording
ta: பதிவு செய்வதைத் தொடங்கவும் நிறுத்தவும்

source: Recording
ta: பதிவு

source: Output format
ta: வெளியீட்டு வடிவம்

source: Use gifski for high quality GIFs
ta: உயர் தரமான GIF களுக்கு GIFSKI ஐப் பயன்படுத்தவும்

source: GIF quality
ta: Gif தகுதி

source: Framerate
ta: பிரேம்ரேட்

source: Resolution downsampling
ta: தெளிவுத்திறன் குறைப்பு

source: Delay in seconds before recording starts
ta: பதிவு தொடங்குவதற்கு முன் விநாடிகளில் நேரந்தவறுகை

source: Capture mouse cursor
ta: மவுச் கர்சரைப் பிடிக்கவும்

source: Capture sound from default PULSE device
ta: இயல்புநிலை துடிப்பு சாதனத்திலிருந்து ஒலியைப் பிடிக்கவும்

source: Peek preferences
ta: முன்னுரிமைகள்

source: Cancel
ta: ரத்துசெய்

source: Set size
ta: அளவு அமைக்கவும்

source: Width
ta: அகலம்

source: Height
ta: உயரம்

source: Record short animated GIF images from your screen
ta: உங்கள் திரையில் இருந்து குறுகிய அனிமேசன் GIF படங்களை பதிவு செய்யுங்கள்

source: screencast;screen recorder;screen capture;GIF;WebM;APNG;
ta: ச்கிரீன்காச்ட்; திரை ரெக்கார்டர்; திரை கேப்சர்; gif; webm; apng;

source: Simple screen recorder with an easy to use interface
ta: பயன்படுத்த எளிதான இடைமுகத்துடன் எளிய திரை ரெக்கார்டர்

source: Peek makes it easy to create short screencasts of a screen area. It was built for the specific use case of recording screen areas, e.g. for easily showing UI features of your own apps or for showing a bug in bug reports. With Peek you simply place the Peek window over the area you want to record and press "Record". Peek is optimized for generating animated GIFs, but you can also directly record to WebM if you prefer.
ta: ஒரு திரை பகுதியின் குறுகிய ச்கிரீன்காச்ட்களை உருவாக்குவதை பீக் எளிதாக்குகிறது. திரை பகுதிகளைப் பதிவு செய்வதற்கான குறிப்பிட்ட பயன்பாட்டு வழக்குக்காக இது கட்டப்பட்டது, எ.கா. உங்கள் சொந்த பயன்பாடுகளின் இடைமுகம் அம்சங்களை எளிதாகக் காண்பிப்பதற்காக அல்லது பிழை அறிக்கைகளில் பிழையைக் காண்பிப்பதற்காக. நீங்கள் பதிவுசெய்ய விரும்பும் பகுதிக்கு மேல் பீக் சாளரத்தை வைக்கவும், "பதிவு" என்பதை அழுத்தவும். அனிமேசன் செய்யப்பட்ட GIF களை உருவாக்குவதற்கு பீக் உகந்ததாக உள்ளது, ஆனால் நீங்கள் விரும்பினால் நீங்கள் நேரடியாக WEBM க்கு பதிவு செய்யலாம்.

source: Features:
ta: அம்சங்கள்:

source: Select a screen region to record
ta: பதிவு செய்ய ஒரு திரை பகுதியைத் தேர்ந்தெடுக்கவும்

source: Save recorded video as an optimized animated GIF
ta: பதிவுசெய்யப்பட்ட வீடியோவை உகந்த அனிமேசன் GIF ஆக சேமிக்கவும்

source: Record directly to WebM format
ta: வெப்எம் வடிவமைப்பிற்கு நேரடியாக பதிவு செய்யுங்கள்

source: Simple user interface optimized for the task
ta: எளிய பயனர் இடைமுகம் பணிக்கு உகந்ததாகும்

source: Automatically downscale recorded videos
ta: தானாகவே பதிவுசெய்யப்பட்ட வீடியோக்கள்

source: Support for HiDPI screens
ta: HIDPI திரைகளுக்கான உதவி

source: Works inside a GNOME Shell Wayland session (using XWayland)
ta: ஒரு சினோம் செல் வேலண்ட் அமர்வுக்குள் வேலை செய்கிறது (எக்ச்வேய்லேண்டைப் பயன்படுத்தி)

source: Peek is not a general purpose screencast app with extended features but rather focuses on the single task of creating small, silent screencasts of an area of the screen for creating GIF animations or silent WebM videos.
ta: பீக் என்பது நீட்டிக்கப்பட்ட அம்சங்களைக் கொண்ட ஒரு பொதுவான நோக்கத்திற்கான ச்கிரீன்காச்ட் பயன்பாடு அல்ல, மாறாக சிஐஎஃப் அனிமேசன்கள் அல்லது அமைதியான வெப்எம் வீடியோக்களை உருவாக்குவதற்காக திரையின் ஒரு பகுதியின் சிறிய, அமைதியான திரைக்காட்சிகளை உருவாக்கும் ஒற்றை பணியில் கவனம் செலுத்துகிறது.

source: The main window to select the recording area
ta: ரெக்கார்டிங் பகுதியைத் தேர்ந்தெடுக்க முக்கிய சாளரம்

source: Peek's preferences dialog
ta: பீக்கின் விருப்பத்தேர்வுகள் உரையாடல்

source: Peek is recording itself
ta: பீக் தன்னை பதிவு செய்கிறார்

source: Philipp Wolfer
ta: பிலிப்பி வோல்பர்

source: Time in milliseconds for which the recording area size is displayed after resizing stops.
ta: மில்லி விநாடிகளில் நேரம் பதிவுசெய்யும் பகுதி அளவு நிறுத்தப்பட்ட பிறகு காட்டப்படும்.

source: Default file name used. Can include date format specifiers. The extension will be added automatically.
ta: இயல்புநிலை கோப்பு பெயர் பயன்படுத்தப்படுகிறது. தேதி வடிவமைப்பு குறிப்பான்களை சேர்க்கலாம். நீட்டிப்பு தானாக சேர்க்கப்படும்.

source: Prefer dark theme
ta: இருண்ட கருப்பொருளை விரும்புங்கள்

source: Global keybinding to toggle recording
ta: பதிவை மாற்றுவதற்கான உலகளாவிய விசைப்பிடித்தல்

source: Output file format
ta: வெளியீட்டு கோப்பு வடிவம்

source: Quality setting for the gifski GIF encoder
ta: GIFSKI GIF குறியாக்கிக்கான தர அமைப்பு

source: Resolution downsampling factor
ta: தெளிவுத்திறன் குறைக்கும் காரணி

source: Whether to capture the mouse cursor
ta: மவுச் கர்சரைப் பிடிக்க வேண்டுமா

source: Whether to capture sound from default PULSE input device
ta: இயல்புநிலை துடிப்பு உள்ளீட்டு சாதனத்திலிருந்து ஒலியைப் பிடிக்க வேண்டுமா

source: Size and position of the last open main window
ta: கடைசி திறந்த முதன்மையான சாளரத்தின் அளவு மற்றும் நிலை

source: Path where last video got saved
ta: கடைசி வீடியோ சேமிக்கப்பட்ட பாதை
